[Killed] BlockStatement
main/components/Users/UsersTable.js:7:49
 
 export default function UsersTable({ users}) {
     //toggleRider
-    function cellToAxiosParamsToggleRider(cell) {
-        return {
-            url: "/api/admin/users/toggleRider",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleRider(cell) {}
   
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests usertable toggle rider tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
