[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:113:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Driver Availability" id="appnavbar-driver-availability-dropdown" data-testid="appnavbar-driver-availability-dropdown" >
-                    <NavDropdown.Item as={Link} to="/driveravailability/">Driver Availability</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {

[Survived] LogicalOperator
main/components/Nav/AppNavbar.js:113:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Driver Availability" id="appnavbar-driver-availability-dropdown" data-testid="appnavbar-driver-availability-dropdown" >
-                    <NavDropdown.Item as={Link} to="/driveravailability/">Driver Availability</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Driver Availability" id="appnavbar-driver-availability-dropdown" data-testid="appnavbar-driver-availability-dropdown">
+                    <NavDropdown.Item as={Link} to="/driveravailability/">Driver Availability</NavDropdown.Item>
+                  </NavDropdown>
               }
               {

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:125:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                false
               }
 
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
