[Killed] ObjectLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:29:54
                             data-testid="DriverAvailabilityForm-driverId"
                             id="driverId"
                             type="number"
-                            {...register("driverId", { required: true })}
+                            {...register("driverId", {})}
                             isInvalid={Boolean(errors.driverId)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Driver ID is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:45:61
                             data-testid="DriverAvailabilityForm-day"
                             id="day"
                             type="text"
-                            {...register("day", { required: true, pattern: dayRegex })}
+                            {...register("day", { required: false, pattern: dayRegex })}
                             isInvalid={Boolean(errors.day)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Day is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:45:49
                             data-testid="DriverAvailabilityForm-day"
                             id="day"
                             type="text"
-                            {...register("day", { required: true, pattern: dayRegex })}
+                            {...register("day", {})}
                             isInvalid={Boolean(errors.day)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Day is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:61:67
                             data-testid="DriverAvailabilityForm-startTime"
                             id="startTime"
                             type="text"
-                            {...register("startTime", { required: true, pattern: timeRegex })}
+                            {...register("startTime", { required: false, pattern: timeRegex })}
                             isInvalid={Boolean(errors.startTime)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Start Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:61:42
                             data-testid="DriverAvailabilityForm-startTime"
                             id="startTime"
                             type="text"
-                            {...register("startTime", { required: true, pattern: timeRegex })}
+                            {...register("", { required: true, pattern: timeRegex })}
                             isInvalid={Boolean(errors.startTime)}
                         />
killedBy: DriverAvailabilityForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/DriverAvailability/DriverAvailabilityForm.js:65:30
                             isInvalid={Boolean(errors.startTime)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startTime && 'Start Time is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Start Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:77:65
                             data-testid="DriverAvailabilityForm-endTime"
                             id="endTime"
                             type="text"
-                            {...register("endTime", { required: true, pattern: timeRegex })}
+                            {...register("endTime", { required: false, pattern: timeRegex })}
                             isInvalid={Boolean(errors.endTime)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: End Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:77:53
                             data-testid="DriverAvailabilityForm-endTime"
                             id="endTime"
                             type="text"
-                            {...register("endTime", { required: true, pattern: timeRegex })}
+                            {...register("endTime", {})}
                             isInvalid={Boolean(errors.endTime)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: End Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/DriverAvailability/DriverAvailabilityForm.js:81:30
                             isInvalid={Boolean(errors.endTime)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.endTime && 'End Time is required.'}
+                            {errors.endTime || 'End Time is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:94:42
                             id="notes"
                             as="textarea"
                             rows={3}
-                            {...register("notes")}
+                            {...register("")}
                         />
                     </Form.Group>
killedBy: DriverAvailabilityForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
