[Killed] ArrowFunction
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function DriverAvailabilityCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (driverAvailability) => ({
-    url: "/api/DriverAvailability/new",
-    method: "POST",
-    params: {
-      driverId: driverAvailability.driverId,
-      day: driverAvailability.day,
-      startTime: driverAvailability.startTime,
-      endTime: driverAvailability.endTime,
-      notes: driverAvailability.notes
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:8:56
 import { toast } from "react-toastify";
 
 export default function DriverAvailabilityCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (driverAvailability) => ({
-    url: "/api/DriverAvailability/new",
-    method: "POST",
-    params: {
-      driverId: driverAvailability.driverId,
-      day: driverAvailability.day,
-      startTime: driverAvailability.startTime,
-      endTime: driverAvailability.endTime,
-      notes: driverAvailability.notes
-    }
-  });
+  const objectToAxiosParams = (driverAvailability) => ({});
 
   const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:36:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/DriverAvailability" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/DriverAvailability"}

Number of calls: 0
