[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:84:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <NavDropdown title="Driver DashBoard" id="appnavbar-driver-dropdown" data-testid="appnavbar-driver-dropdown" >
-                  <NavDropdown.Item as={Link} to="/drivershifts">Dashboard</NavDropdown.Item>
-                </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders correctly for regular logged in driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-driver-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:84:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <NavDropdown title="Driver DashBoard" id="appnavbar-driver-dropdown" data-testid="appnavbar-driver-dropdown" >
-                  <NavDropdown.Item as={Link} to="/drivershifts">Dashboard</NavDropdown.Item>
-                </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders correctly for regular logged in driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-driver-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:91:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_DRIVER") && (
-                      <NavDropdown.Item data-testid="appnavbar-shift-dropdown-availability" as={Link} to="/driveravailability/">Availability</NavDropdown.Item>
-                    )}
-                  </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown">
+                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_DRIVER") && <NavDropdown.Item data-testid="appnavbar-shift-dropdown-availability" as={Link} to="/driveravailability/">Availability</NavDropdown.Item>}
+                  </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:91:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_DRIVER") && (
-                      <NavDropdown.Item data-testid="appnavbar-shift-dropdown-availability" as={Link} to="/driveravailability/">Availability</NavDropdown.Item>
-                    )}
-                  </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:94:22
                 isParticipant(currentUser) && (
                   <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
                     <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_DRIVER") && (
-                      <NavDropdown.Item data-testid="appnavbar-shift-dropdown-availability" as={Link} to="/driveravailability/">Availability</NavDropdown.Item>
-                    )}
+                    {true}
                   </NavDropdown>
                 )
killedBy: AppNavbar tests render shift driver dropdown for driver
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-shift-dropdown-availability/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:94:22
                 isParticipant(currentUser) && (
                   <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
                     <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    {hasRole(currentUser, "ROLE_DRIVER") && (
-                      <NavDropdown.Item data-testid="appnavbar-shift-dropdown-availability" as={Link} to="/driveravailability/">Availability</NavDropdown.Item>
-                    )}
+                    {hasRole(currentUser, "ROLE_DRIVER") || <NavDropdown.Item data-testid="appnavbar-shift-dropdown-availability" as={Link} to="/driveravailability/">Availability</NavDropdown.Item>}
                   </NavDropdown>
                 )
killedBy: AppNavbar tests render shift driver dropdown for driver
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-shift-dropdown-availability/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:116:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <Nav.Link id ="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/drivers/list">Drivers Page</Nav.Link>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders driver page link for driver
statusReason: Error: Unable to find an element with the text: /Drivers/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:121:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                true
               }
 
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:121:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                !hasRole(currentUser, "ROLE_RIDER") || <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
               }
 
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
