[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityIndexPage.js:10:55
 import Button from 'react-bootstrap/Button';
 import { Link } from 'react-router-dom';
 
-export default function DriverAvailabilityIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: driverAvailabilities, error: _error, status: _status } =
-    useBackend(
-      // Adjusted to match the DriverAvailability API endpoint
-      ["/api/driverAvailability/admin/all"],
-      { method: "GET", url: "/api/driverAvailability/admin/all" },
-      []
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-          <Button style={{ float: "right" }} as={Link} to="/driveravailability/create">
-            Create Driver Availability
-          </Button>
-          <h1>Driver Availabilities</h1>
-        <DriverAvailabilityTable driverAvailabilities={driverAvailabilities} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DriverAvailabilityIndexPage() {}
 
killedBy: DriverAvailabilityIndexPage tests renders without crashing for admin user
statusReason: Error: DriverAvailabilityIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] ArrayDeclaration
main/pages/DriverAvailability/DriverAvailabilityIndexPage.js:17:7
   const { data: driverAvailabilities, error: _error, status: _status } =
     useBackend(
       // Adjusted to match the DriverAvailability API endpoint
-      ["/api/driverAvailability/admin/all"],
+      [],
       { method: "GET", url: "/api/driverAvailability/admin/all" },
       []

[Killed] StringLiteral
main/pages/DriverAvailability/DriverAvailabilityIndexPage.js:18:29
     useBackend(
       // Adjusted to match the DriverAvailability API endpoint
       ["/api/driverAvailability/admin/all"],
-      { method: "GET", url: "/api/driverAvailability/admin/all" },
+      { method: "GET", url: "" },
       []
     );
killedBy: DriverAvailabilityIndexPage tests renders driver availabilities without crashing for admin user
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/DriverAvailability/DriverAvailabilityIndexPage.js:25:35
   return (
     <BasicLayout>
       <div className="pt-2">
-          <Button style={{ float: "right" }} as={Link} to="/driveravailability/create">
+          <Button style={{ float: "" }} as={Link} to="/driveravailability/create">
             Create Driver Availability
           </Button>
killedBy: DriverAvailabilityIndexPage tests renders without crashing for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
