[Killed] BooleanLiteral
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:7:68
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function DriverAvailabilityCreatePage({ storybook = false }) {
+export default function DriverAvailabilityCreatePage({ storybook = true }) {
   const objectToAxiosParams = (driverAvailability) => ({
     url: "/api/driverAvailability/new",
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/driveravailability"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function DriverAvailabilityCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (driverAvailability) => ({
-    url: "/api/driverAvailability/new",
-    method: "POST",
-    params: {
-      driverId: driverAvailability.driverId,
-      day: driverAvailability.day,
-      startTime: driverAvailability.startTime,
-      endTime: driverAvailability.endTime,
-      notes: driverAvailability.notes
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:8:56
 import { toast } from "react-toastify";
 
 export default function DriverAvailabilityCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (driverAvailability) => ({
-    url: "/api/driverAvailability/new",
-    method: "POST",
-    params: {
-      driverId: driverAvailability.driverId,
-      day: driverAvailability.day,
-      startTime: driverAvailability.startTime,
-      endTime: driverAvailability.endTime,
-      notes: driverAvailability.notes
-    }
-  });
+  const objectToAxiosParams = (driverAvailability) => ({});
 
   const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:11:13
   const objectToAxiosParams = (driverAvailability) => ({
     url: "/api/driverAvailability/new",
     method: "POST",
-    params: {
-      driverId: driverAvailability.driverId,
-      day: driverAvailability.day,
-      startTime: driverAvailability.startTime,
-      endTime: driverAvailability.endTime,
-      notes: driverAvailability.notes
-    }
+    params: {}
   });
 
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "day": "Friday",
-   "driverId": "1",

[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:20:45
     }
   });
 
-  const onSuccess = (driverAvailability) => {
-    toast(`New Driver Availability Created - id: ${driverAvailability.id} for driverId: ${driverAvailability.driverId}`);
-  }
+  const onSuccess = (driverAvailability) => {}
   const mutation = useBackendMutation(
     objectToAxiosParams,
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Driver Availability Created - id: 1 for driverId: 1"

Number of calls: 0

[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:36:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/driveravailability" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/driveravailability"}

Number of calls: 0
