[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityIndexPage.js:9:55
 import { hasRole, useCurrentUser } from 'main/utils/currentUser';
 import Button from 'react-bootstrap/Button';
 import { Link } from 'react-router-dom';
-export default function DriverAvailabilityIndexPage() {
-
-  const currentUser = useCurrentUser();
-  const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
-
-  const { data: driverAvailabilities, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable all : hard to test for query caching
-      isAdmin ? ["/api/driverAvailability/admin/all"] : ["/api/driverAvailability/all"],
-      { method: "GET", url: isAdmin ? "/api/driverAvailability/admin/all" : "/api/driverAvailability/all" },
-      []
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-          <Button style={{ float: "right" }} as={Link} to="/driveravailability/create">
-            Create Driver Availability
-          </Button>
-          <h1>Driver Availabilities</h1>
-        <DriverAvailabilityTable driverAvailabilities={driverAvailabilities} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DriverAvailabilityIndexPage() {}
 
killedBy: DriverAvailabilityIndexPage tests renders without crashing for regular user
statusReason: Error: DriverAvailabilityIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
