[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:43:21
             accessor: 'endTime',
         },
         {
-            Header: 'Driver ID',
+            Header: "",
             accessor: 'driverId',
         },
killedBy: DriverAvailabilityTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Driver ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:44:23
         },
         {
             Header: 'Driver ID',
-            accessor: 'driverId',
+            accessor: "",
         },
         {
killedBy: DriverAvailabilityTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DriverAvailabilityTable-cell-row-0-col-driverId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
