[Killed] BooleanLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:25:66
                             data-testid="DriverAvailabilityForm-driverId"
                             id="driverId"
                             type="number"
-                            {...register("driverId", { required: true })}
+                            {...register("driverId", { required: false })}
                             isInvalid={Boolean(errors.driverId)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Driver ID is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/DriverAvailability/DriverAvailabilityForm.js:29:30
                             isInvalid={Boolean(errors.driverId)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.driverId && 'Driver ID is required.'}
+                            {errors.driverId || 'Driver ID is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/DriverAvailability/DriverAvailabilityForm.js:29:30
                             isInvalid={Boolean(errors.driverId)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.driverId && 'Driver ID is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Driver ID is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:41:61
                             data-testid="DriverAvailabilityForm-day"
                             id="day"
                             type="text"
-                            {...register("day", { required: true })}
+                            {...register("day", { required: false })}
                             isInvalid={Boolean(errors.day)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Day is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:41:42
                             data-testid="DriverAvailabilityForm-day"
                             id="day"
                             type="text"
-                            {...register("day", { required: true })}
+                            {...register("", { required: true })}
                             isInvalid={Boolean(errors.day)}
                         />
killedBy: DriverAvailabilityForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/DriverAvailability/DriverAvailabilityForm.js:45:30
                             isInvalid={Boolean(errors.day)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.day && 'Day is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Day is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/DriverAvailability/DriverAvailabilityForm.js:45:30
                             isInvalid={Boolean(errors.day)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.day && 'Day is required.'}
+                            {errors.day || 'Day is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] BooleanLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:57:67
                             data-testid="DriverAvailabilityForm-startTime"
                             id="startTime"
                             type="text"
-                            {...register("startTime", { required: true })}
+                            {...register("startTime", { required: false })}
                             isInvalid={Boolean(errors.startTime)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Start Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/DriverAvailability/DriverAvailabilityForm.js:61:30
                             isInvalid={Boolean(errors.startTime)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startTime && 'Start Time is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: Start Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/DriverAvailability/DriverAvailabilityForm.js:61:30
                             isInvalid={Boolean(errors.startTime)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startTime && 'Start Time is required.'}
+                            {errors.startTime || 'Start Time is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] BooleanLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:73:65
                             data-testid="DriverAvailabilityForm-endTime"
                             id="endTime"
                             type="text"
-                            {...register("endTime", { required: true })}
+                            {...register("endTime", { required: false })}
                             isInvalid={Boolean(errors.endTime)}
                         />
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: End Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/DriverAvailability/DriverAvailabilityForm.js:77:30
                             isInvalid={Boolean(errors.endTime)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.endTime && 'End Time is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: End Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/DriverAvailability/DriverAvailabilityForm.js:77:30
                             isInvalid={Boolean(errors.endTime)}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.endTime && 'End Time is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: DriverAvailabilityForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: End Time is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ArrowFunction
main/components/DriverAvailability/DriverAvailabilityForm.js:101:58
                     <Button type="submit" data-testid="DriverAvailabilityForm-submit">
                         {buttonLabel}
                     </Button>
-                    <Button variant="Secondary" onClick={() => navigate(-1)} data-testid="DriverAvailabilityForm-cancel">
+                    <Button variant="Secondary" onClick={() => undefined} data-testid="DriverAvailabilityForm-cancel">
                         Cancel
                     </Button>
killedBy: DriverAvailabilityForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

<html>
  <head />

[Killed] UnaryOperator
main/components/DriverAvailability/DriverAvailabilityForm.js:101:73
                     <Button type="submit" data-testid="DriverAvailabilityForm-submit">
                         {buttonLabel}
                     </Button>
-                    <Button variant="Secondary" onClick={() => navigate(-1)} data-testid="DriverAvailabilityForm-cancel">
+                    <Button variant="Secondary" onClick={() => navigate(+1)} data-testid="DriverAvailabilityForm-cancel">
                         Cancel
                     </Button>
killedBy: DriverAvailabilityForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

<html>
