[Killed] BlockStatement
main/components/DriverAvailability/DriverAvailabilityTable.js:10:36
 export default function DriverAvailabilityTable ({ driverAvailabilities, currentUser }) { // if admin, needs currentUser
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/driverAvailability/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
     
 
killedBy: DriverAvailabilityTable tests Has the expected column headers and content for ordinary driver
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/driverAvailability/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/DriverAvailability/DriverAvailabilityTable.js:43:9
             Header: 'End Time',
             accessor: 'endTime',
         },
-        {
-            Header: 'Driver ID',
-            accessor: 'driverId',
-        },
+        {},
         {
             Header: 'Notes',
killedBy: DriverAvailabilityTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/DriverAvailability/DriverAvailabilityTable.js:55:9
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "DriverAvailabilityTable"));
     } 
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER") ){
+    if (false ){
         columns.push(ButtonColumn("Edit", "primary", editCallback, "DriverAvailabilityTable"));
     } 
killedBy: DriverAvailabilityTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DriverAvailabilityTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] LogicalOperator
main/components/DriverAvailability/DriverAvailabilityTable.js:55:9
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "DriverAvailabilityTable"));
     } 
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER") ){
+    if (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_DRIVER") ){
         columns.push(ButtonColumn("Edit", "primary", editCallback, "DriverAvailabilityTable"));
     } 
killedBy: DriverAvailabilityTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DriverAvailabilityTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/DriverAvailability/DriverAvailabilityTable.js:56:35
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "DriverAvailabilityTable"));
     } 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER") ){
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "DriverAvailabilityTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "DriverAvailabilityTable"));
     } 
     return <OurTable
killedBy: DriverAvailabilityTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/DriverAvailability/DriverAvailabilityTable.js:56:43
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "DriverAvailabilityTable"));
     } 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER") ){
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "DriverAvailabilityTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "DriverAvailabilityTable"));
     } 
     return <OurTable
killedBy: DriverAvailabilityTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/DriverAvailability/DriverAvailabilityTable.js:61:17
     return <OurTable
         data={driverAvailabilities}
         columns={columns}
-        testid={"DriverAvailabilityTable"}
+        testid={""}
     />;
 };
killedBy: DriverAvailabilityTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DriverAvailabilityTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
