[Killed] ObjectLiteral
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:19:21
         {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
             method: "GET",
             url: `/api/driverAvailability`,
-            params: {
-            id
-            }
+            params: {}
         }
     );
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:26:36
     );
 
 
-    const objectToAxiosPutParams = (driverAvailabilities) => ({
-        url: "/api/driverAvailability",
-        method: "PUT",
-        params: {
-            id: driverAvailabilities.id,
-        },
-        data: {
-            day: driverAvailabilities.day,
-            startTime: driverAvailabilities.start,
-            endTime: driverAvailabilities.end, 
-            driverId: driverAvailabilities.driverId,
-            notes: driverAvailabilities.notes
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (driverAvailabilities) => {
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:26:63
     );
 
 
-    const objectToAxiosPutParams = (driverAvailabilities) => ({
-        url: "/api/driverAvailability",
-        method: "PUT",
-        params: {
-            id: driverAvailabilities.id,
-        },
-        data: {
-            day: driverAvailabilities.day,
-            startTime: driverAvailabilities.start,
-            endTime: driverAvailabilities.end, 
-            driverId: driverAvailabilities.driverId,
-            notes: driverAvailabilities.notes
-        }
-    });
+    const objectToAxiosPutParams = (driverAvailabilities) => ({});
 
     const onSuccess = (driverAvailabilities) => {
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:28:17
 
     const objectToAxiosPutParams = (driverAvailabilities) => ({
         url: "/api/driverAvailability",
-        method: "PUT",
+        method: "",
         params: {
             id: driverAvailabilities.id,
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:41:49
         }
     });
 
-    const onSuccess = (driverAvailabilities) => {
-        toast(`Driver Availability Updated - id: ${driverAvailabilities.id}`);
-    }
+    const onSuccess = (driverAvailabilities) => {}
 
     const mutation = useBackendMutation(
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:58:20
         mutation.mutate(data);
     }
 
-    if (isSuccess) {
-        return <Navigate to="/driverAvailability/" />
-    }
+    if (isSuccess) {}
 
     return (
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/driverAvailability/"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:66:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Driver Availability </h1>
-                {driverAvailabilities &&
-                    <DriverAvailabilityForm initialContents={driverAvailabilities} submitAction={onSubmit} buttonLabel="Update" />
+                {true
                 }
             </div>
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:66:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Driver Availability </h1>
-                {driverAvailabilities &&
-                    <DriverAvailabilityForm initialContents={driverAvailabilities} submitAction={onSubmit} buttonLabel="Update" />
+                {driverAvailabilities || <DriverAvailabilityForm initialContents={driverAvailabilities} submitAction={onSubmit} buttonLabel="Update" />
                 }
             </div>
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, day, startTime, endTime, driverId, notes}). If you meant to render a collection of children, use an array instead.
